yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3189.h
/* TIM4 counter */
__IO_REG8    (TIM4_CNTR,   0x52E7, __READ_WRITE);
/* TIM4 prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 4;
} __BITS_TIM4_PSCR;
#endif
__IO_REG8_BIT(TIM4_PSCR,   0x52E8, __READ_WRITE, __BITS_TIM4_PSCR);

/* TIM4 Auto-reload register */
__IO_REG8    (TIM4_ARR,    0x52E9, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      TIM4 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM4_CR1_CEN             TIM4_CR1_bit.CEN
#define TIM4_CR1_UDIS            TIM4_CR1_bit.UDIS
#define TIM4_CR1_URS             TIM4_CR1_bit.URS
#define TIM4_CR1_OPM             TIM4_CR1_bit.OPM
#define TIM4_CR1_ARPE            TIM4_CR1_bit.ARPE

#define TIM4_CR2_MMS             TIM4_CR2_bit.MMS

#define TIM4_SMCR_SMS            TIM4_SMCR_bit.SMS
#define TIM4_SMCR_TS             TIM4_SMCR_bit.TS
#define TIM4_SMCR_MSM            TIM4_SMCR_bit.MSM

#define TIM4_DER_UDE             TIM4_DER_bit.UDE

#define TIM4_IER_UIE             TIM4_IER_bit.UIE
#define TIM4_IER_TIE             TIM4_IER_bit.TIE

#define TIM4_SR1_UIF             TIM4_SR1_bit.UIF
#define TIM4_SR1_TIF             TIM4_SR1_bit.TIF

#define TIM4_EGR_UG              TIM4_EGR_bit.UG
#define TIM4_EGR_TG              TIM4_EGR_bit.TG

#define TIM4_PSCR_PSC            TIM4_PSCR_bit.PSC

#endif

/*-------------------------------------------------------------------------
 *      TIM4 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM4_CR1_CEN        0x01
#define MASK_TIM4_CR1_UDIS       0x02
#define MASK_TIM4_CR1_URS        0x04
#define MASK_TIM4_CR1_OPM        0x08
#define MASK_TIM4_CR1_ARPE       0x80

#define MASK_TIM4_CR2_MMS        0x70

#define MASK_TIM4_SMCR_SMS       0x07
#define MASK_TIM4_SMCR_TS        0x70
#define MASK_TIM4_SMCR_MSM       0x80

#define MASK_TIM4_DER_UDE        0x01

#define MASK_TIM4_IER_UIE        0x01
#define MASK_TIM4_IER_TIE        0x40

#define MASK_TIM4_SR1_UIF        0x01
#define MASK_TIM4_SR1_TIF        0x40

#define MASK_TIM4_EGR_UG         0x01
#define MASK_TIM4_EGR_TG         0x40

#define MASK_TIM4_PSCR_PSC       0x0F


/*-------------------------------------------------------------------------
 *      IRTIM register definitions
 *-----------------------------------------------------------------------*/
/* Infrared control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IR_EN       : 1;
  unsigned char HS_EN       : 1;
} __BITS_IR_CR;
#endif
__IO_REG8_BIT(IR_CR,       0x52FF, __READ_WRITE, __BITS_IR_CR);


/*-------------------------------------------------------------------------
 *      IRTIM bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define IR_CR_IR_EN              IR_CR_bit.IR_EN
#define IR_CR_HS_EN              IR_CR_bit.HS_EN

#endif

/*-------------------------------------------------------------------------
 *      IRTIM bit masks
 *-----------------------------------------------------------------------*/
#define MASK_IR_CR_IR_EN         0x01
#define MASK_IR_CR_HS_EN         0x02


/*-------------------------------------------------------------------------
 *      TIM5 register definitions
 *-----------------------------------------------------------------------*/
/* TIM5 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM5_CR1;
#endif
__IO_REG8_BIT(TIM5_CR1,    0x5300, __READ_WRITE, __BITS_TIM5_CR1);

/* TIM5 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 3;
  unsigned char CCDS        : 1;
  unsigned char MMS         : 3;
  unsigned char TI1S        : 1;
} __BITS_TIM5_CR2;
#endif
__IO_REG8_BIT(TIM5_CR2,    0x5301, __READ_WRITE, __BITS_TIM5_CR2);

/* TIM5 Slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM5_SMCR;
#endif
__IO_REG8_BIT(TIM5_SMCR,   0x5302, __READ_WRITE, __BITS_TIM5_SMCR);

/* TIM5 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM5_ETR;
#endif
__IO_REG8_BIT(TIM5_ETR,    0x5303, __READ_WRITE, __BITS_TIM5_ETR);

/* TIM5 DMA1 request enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UDE         : 1;
  unsigned char CC1DE       : 1;
  unsigned char CC2DE       : 1;
} __BITS_TIM5_DER;
#endif
__IO_REG8_BIT(TIM5_DER,    0x5304, __READ_WRITE, __BITS_TIM5_DER);

/* TIM5 interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char             : 3;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM5_IER;
#endif
__IO_REG8_BIT(TIM5_IER,    0x5305, __READ_WRITE, __BITS_TIM5_IER);

/* TIM5 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char             : 3;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM5_SR1;
#endif
__IO_REG8_BIT(TIM5_SR1,    0x5306, __READ_WRITE, __BITS_TIM5_SR1);

/* TIM5 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
} __BITS_TIM5_SR2;
#endif
__IO_REG8_BIT(TIM5_SR2,    0x5307, __READ_WRITE, __BITS_TIM5_SR2);

/* TIM5 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char             : 3;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM5_EGR;
#endif
__IO_REG8_BIT(TIM5_EGR,    0x5308, __WRITE, __BITS_TIM5_EGR);

