yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3189.h
/* DAC channel 1 right aligned data holding register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RDHRH00     : 1;
  unsigned char RDHRH10     : 1;
  unsigned char RDHRH20     : 1;
  unsigned char RDHRH30     : 1;
} __BITS_DAC_CH1RDHRH;
#endif
__IO_REG8_BIT(DAC_CH1RDHRH, 0x5388, __READ_WRITE, __BITS_DAC_CH1RDHRH);

/* DAC channel 1 right aligned data holding register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RDHRL00     : 1;
  unsigned char RDHRL10     : 1;
  unsigned char RDHRL20     : 1;
  unsigned char RDHRL30     : 1;
  unsigned char RDHRL40     : 1;
  unsigned char RDHRL50     : 1;
  unsigned char RDHRL60     : 1;
  unsigned char RDHRL70     : 1;
} __BITS_DAC_CH1RDHRL;
#endif
__IO_REG8_BIT(DAC_CH1RDHRL, 0x5389, __READ_WRITE, __BITS_DAC_CH1RDHRL);

/* DAC channel 1 left aligned data holding register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LDHRH00     : 1;
  unsigned char LDHRH10     : 1;
  unsigned char LDHRH20     : 1;
  unsigned char LDHRH30     : 1;
  unsigned char LDHRH40     : 1;
  unsigned char LDHRH50     : 1;
  unsigned char LDHRH60     : 1;
  unsigned char LDHRH70     : 1;
} __BITS_DAC_CH1LDHRH;
#endif
__IO_REG8_BIT(DAC_CH1LDHRH, 0x538C, __READ_WRITE, __BITS_DAC_CH1LDHRH);

/* DAC channel 1 left aligned data holding register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char LDHRL4      : 1;
  unsigned char LDHRL5      : 1;
  unsigned char LDHRL6      : 1;
  unsigned char LDHRL7      : 1;
} __BITS_DAC_CH1LDHRL;
#endif
__IO_REG8_BIT(DAC_CH1LDHRL, 0x538D, __READ_WRITE, __BITS_DAC_CH1LDHRL);

/* DAC channel 1 8-bit data holding register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DHR00       : 1;
  unsigned char DHR10       : 1;
  unsigned char DHR20       : 1;
  unsigned char DHR30       : 1;
  unsigned char DHR40       : 1;
  unsigned char DHR50       : 1;
  unsigned char DHR60       : 1;
  unsigned char DHR70       : 1;
} __BITS_DAC_CH1DHR8;
#endif
__IO_REG8_BIT(DAC_CH1DHR8, 0x5390, __READ_WRITE, __BITS_DAC_CH1DHR8);

/* DAC channel 2 right aligned data holding register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RDHRH00     : 1;
  unsigned char RDHRH10     : 1;
  unsigned char RDHRH20     : 1;
  unsigned char RDHRH30     : 1;
} __BITS_DAC_CH2RDHRH;
#endif
__IO_REG8_BIT(DAC_CH2RDHRH, 0x5394, __READ_WRITE, __BITS_DAC_CH2RDHRH);

/* DAC channel 2 right aligned data holding register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RDHRL00     : 1;
  unsigned char RDHRL10     : 1;
  unsigned char RDHRL20     : 1;
  unsigned char RDHRL30     : 1;
  unsigned char RDHRL40     : 1;
  unsigned char RDHRL50     : 1;
  unsigned char RDHRL60     : 1;
  unsigned char RDHRL70     : 1;
} __BITS_DAC_CH2RDHRL;
#endif
__IO_REG8_BIT(DAC_CH2RDHRL, 0x5395, __READ_WRITE, __BITS_DAC_CH2RDHRL);

/* DAC channel 2 left aligned data holding register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LDHRH00     : 1;
  unsigned char LDHRH10     : 1;
  unsigned char LDHRH20     : 1;
  unsigned char LDHRH30     : 1;
  unsigned char LDHRH40     : 1;
  unsigned char LDHRH50     : 1;
  unsigned char LDHRH60     : 1;
  unsigned char LDHRH70     : 1;
} __BITS_DAC_CH2LDHRH;
#endif
__IO_REG8_BIT(DAC_CH2LDHRH, 0x5398, __READ_WRITE, __BITS_DAC_CH2LDHRH);

/* DAC channel 2 left aligned data holding register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char LDHRL4      : 1;
  unsigned char LDHRL5      : 1;
  unsigned char LDHRL6      : 1;
  unsigned char LDHRL7      : 1;
} __BITS_DAC_CH2LDHRL;
#endif
__IO_REG8_BIT(DAC_CH2LDHRL, 0x5399, __READ_WRITE, __BITS_DAC_CH2LDHRL);

/* DAC channel 2 8-bit data holding register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DHR00       : 1;
  unsigned char DHR10       : 1;
  unsigned char DHR20       : 1;
  unsigned char DHR30       : 1;
  unsigned char DHR40       : 1;
  unsigned char DHR50       : 1;
  unsigned char DHR60       : 1;
  unsigned char DHR70       : 1;
} __BITS_DAC_CH2DHR8;
#endif
__IO_REG8_BIT(DAC_CH2DHR8, 0x539C, __READ_WRITE, __BITS_DAC_CH2DHR8);

/* DAC channel 1 right aligned data holding register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RDHRH00     : 1;
  unsigned char RDHRH10     : 1;
  unsigned char RDHRH20     : 1;
  unsigned char RDHRH30     : 1;
} __BITS_DAC_DCH1RDHRH;
#endif
__IO_REG8_BIT(DAC_DCH1RDHRH, 0x53A0, __READ_WRITE, __BITS_DAC_DCH1RDHRH);

/* DAC channel 1 right aligned data holding register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RDHRL00     : 1;
  unsigned char RDHRL10     : 1;
  unsigned char RDHRL20     : 1;
  unsigned char RDHRL30     : 1;
  unsigned char RDHRL40     : 1;
  unsigned char RDHRL50     : 1;
  unsigned char RDHRL60     : 1;
  unsigned char RDHRL70     : 1;
} __BITS_DAC_DCH1RDHRL;
#endif
__IO_REG8_BIT(DAC_DCH1RDHRL, 0x53A1, __READ_WRITE, __BITS_DAC_DCH1RDHRL);

/* DAC data output register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DORH        : 4;
} __BITS_DAC_DORH;
#endif
__IO_REG8_BIT(DAC_DORH,    0x53AC, __READ, __BITS_DAC_DORH);

/* DAC data output register low */
__IO_REG8    (DAC_DORL,    0x53AD, __READ);
/* DAC channel 2 right aligned data holding register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RDHRH00     : 1;
  unsigned char RDHRH10     : 1;
  unsigned char RDHRH20     : 1;
  unsigned char RDHRH30     : 1;
} __BITS_DAC_DCH2RDHRH;
#endif
__IO_REG8_BIT(DAC_DCH2RDHRH, 0x53A2, __READ_WRITE, __BITS_DAC_DCH2RDHRH);

/* DAC channel 2 right aligned data holding register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RDHRL00     : 1;
  unsigned char RDHRL10     : 1;
  unsigned char RDHRL20     : 1;
  unsigned char RDHRL30     : 1;
  unsigned char RDHRL40     : 1;
  unsigned char RDHRL50     : 1;
  unsigned char RDHRL60     : 1;
  unsigned char RDHRL70     : 1;
} __BITS_DAC_DCH2RDHRL;
#endif
__IO_REG8_BIT(DAC_DCH2RDHRL, 0x53A3, __READ_WRITE, __BITS_DAC_DCH2RDHRL);

/* DAC channel 1left aligned data holding register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LDHRH00     : 1;
  unsigned char LDHRH10     : 1;
  unsigned char LDHRH20     : 1;
  unsigned char LDHRH30     : 1;
  unsigned char LDHRH40     : 1;
  unsigned char LDHRH50     : 1;
  unsigned char LDHRH60     : 1;
  unsigned char LDHRH70     : 1;
} __BITS_DAC_DCH1LDHRH;
#endif
__IO_REG8_BIT(DAC_DCH1LDHRH, 0x53A4, __READ_WRITE, __BITS_DAC_DCH1LDHRH);

/* DAC channel 1left aligned data holding register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char LDHRL40     : 1;
  unsigned char LDHRL50     : 1;
  unsigned char LDHRL60     : 1;
  unsigned char LDHRL70     : 1;
} __BITS_DAC_DCH1LDHRL;
#endif
__IO_REG8_BIT(DAC_DCH1LDHRL, 0x53A5, __READ_WRITE, __BITS_DAC_DCH1LDHRL);

/* DAC channel 2 left aligned data holding register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LDHRH00     : 1;
  unsigned char LDHRH10     : 1;
  unsigned char LDHRH20     : 1;
  unsigned char LDHRH30     : 1;
  unsigned char LDHRH40     : 1;
  unsigned char LDHRH50     : 1;
  unsigned char LDHRH60     : 1;
  unsigned char LDHRH70     : 1;
} __BITS_DAC_DCH2LDHRH;
#endif
__IO_REG8_BIT(DAC_DCH2LDHRH, 0x53A6, __READ_WRITE, __BITS_DAC_DCH2LDHRH);

/* DAC channel 2 left aligned data holding register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char LDHRL40     : 1;
  unsigned char LDHRL50     : 1;
  unsigned char LDHRL60     : 1;
  unsigned char LDHRL70     : 1;
} __BITS_DAC_DCH2LDHRL;
#endif
__IO_REG8_BIT(DAC_DCH2LDHRL, 0x53A7, __READ_WRITE, __BITS_DAC_DCH2LDHRL);

/* DAC channel 1 8-bit mode data holding register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DHR00       : 1;
  unsigned char DHR10       : 1;
  unsigned char DHR20       : 1;
  unsigned char DHR30       : 1;
  unsigned char DHR40       : 1;
  unsigned char DHR50       : 1;
  unsigned char DHR60       : 1;
  unsigned char DHR70       : 1;
} __BITS_DAC_DCH1DHR8;
#endif
__IO_REG8_BIT(DAC_DCH1DHR8, 0x53A8, __READ_WRITE, __BITS_DAC_DCH1DHR8);

/* DAC channel 2 8-bit mode data holding register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DHR00       : 1;
  unsigned char DHR10       : 1;
  unsigned char DHR20       : 1;
  unsigned char DHR30       : 1;
  unsigned char DHR40       : 1;
  unsigned char DHR50       : 1;
  unsigned char DHR60       : 1;
  unsigned char DHR70       : 1;
} __BITS_DAC_DCH2DHR8;
#endif
__IO_REG8_BIT(DAC_DCH2DHR8, 0x53A9, __READ_WRITE, __BITS_DAC_DCH2DHR8);

